Бухгалтерские_задачи_Занятие_5/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>НеИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>ПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_Занятие_5/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ДвиженияДенежныхСредств</types>
    <types>CatalogRef.Договоры</types>
    <types>DocumentRef.ПеремещениеТоваров</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Склады</types>
    <types>DocumentRef.ПоступлениеТоваров</types>
    <types>DocumentRef.РучнаяОперация</types>
  </type>
  <predefined>
    <items>
      <name>ДвиженияДенежныхСредств</name>
      <description>Движения денежных средств</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.ДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Партия</name>
      <description>Партия</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ПоступлениеТоваров</types>
        <types>DocumentRef.РучнаяОперация</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Бухгалтерские_задачи_Занятие_5/src/CommonForms/ФормаКонстант/Module.bsl
#Область ОбработчикиСобытийФормы

	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		ЗаполнитьЗначенияСвойств(ЭталонныйНабор, НаборКонстант);
	
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ПослеЗаписи(ПараметрыЗаписи)
	
		ОбновитьИнтерфейс();
	
	КонецПроцедуры
	
	&НаСервере
	Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
		Если ЭталонныйНабор.СкладскойУчет <> НаборКонстант.СкладскойУчет Тогда
	
			ЭталонныйНабор.СкладскойУчет = НаборКонстант.СкладскойУчет;
	
			ОбработатьСубконтоСклады();
	
		КонецЕсли;
	
		Если ЭталонныйНабор.РасчетыПоДоговорам <> НаборКонстант.РасчетыПоДоговорам Тогда
	
			ЭталонныйНабор.РасчетыПоДоговорам = НаборКонстант.РасчетыПоДоговорам;
	
			ОбработатьСубконтоДоговоры();
	
		КонецЕсли;
	
		Если ЭталонныйНабор.УчетДДС <> НаборКонстант.УчетДДС Тогда
	
			ЭталонныйНабор.УчетДДС = НаборКонстант.УчетДДС;
	
			ОбработатьСубконтоДДС();
	
		КонецЕсли;
	
	КонецПроцедуры
	
#КонецОбласти


#Область ОбработкаСубконтоУСчетов
	&НаСервере
	Процедура ОбработатьСубконтоСклады()
	
		ВестиУчет = ПолучитьФункциональнуюОпцию("УчетПоСкладам");
	
		ВидСубконто = ?(ВестиУчет, ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, ПланыВидовХарактеристик.ВидыСубконто.Склады);
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
			|	СчетаВидыСубконто.Ссылка
			|ИЗ
			|	ПланСчетов.Счета.ВидыСубконто КАК СчетаВидыСубконто
			|ГДЕ
			|	СчетаВидыСубконто.ВидСубконто = &ВидСубконто";
	
		Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
			ПС_Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	
			Если ВестиУчет Тогда
	
				Если ПС_Объект.ВидыСубконто.Количество() = 2 Тогда
					Продолжить;
				КонецЕсли;
	
				НоваяСтрока = ПС_Объект.ВидыСубконто.Добавить();
				НоваяСтрока.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Склады;
	
			Иначе
	
				СтрокаДляУдаления = ПС_Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Склады, "ВидСубконто");
	
				ПС_Объект.ВидыСубконто.Удалить(СтрокаДляУдаления);
	
			КонецЕсли;
	
			ПС_Объект.Записать();
	
		КонецЦикла;
	
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	КонецПроцедуры
	
	&НаСервере
	Процедура ОбработатьСубконтоДоговоры()
	
		ВестиУчет = ПолучитьФункциональнуюОпцию("РасчетыПоДоговорам");
	
		ВидСубконто = ?(ВестиУчет, ПланыВидовХарактеристик.ВидыСубконто.Контрагенты, ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
			|	СчетаВидыСубконто.Ссылка
			|ИЗ
			|	ПланСчетов.Счета.ВидыСубконто КАК СчетаВидыСубконто
			|ГДЕ
			|	СчетаВидыСубконто.ВидСубконто = &ВидСубконто";
	
		Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
			ПС_Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	
			Если ВестиУчет Тогда
	
				Если ПС_Объект.ВидыСубконто.Количество() = 2 Тогда
					Продолжить;
				КонецЕсли;
	
				НоваяСтрока = ПС_Объект.ВидыСубконто.Добавить();
				НоваяСтрока.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Договоры;
	
			Иначе
	
				СтрокаДляУдаления = ПС_Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры, "ВидСубконто");
	
				ПС_Объект.ВидыСубконто.Удалить(СтрокаДляУдаления);
	
			КонецЕсли;
	
			ПС_Объект.Записать();
	
		КонецЦикла;
	
	КонецПроцедуры
	
	&НаСервере
	Процедура ОбработатьСубконтоДДС()
	
		ВестиУчет = ПолучитьФункциональнуюОпцию("УчетДДС");
	
		Если ВестиУчет Тогда
	
			СписокСчетовУчетаДС = Новый СписокЗначений;
			СписокСчетовУчетаДС.Добавить(ПланыСчетов.Счета.Касса);
			СписокСчетовУчетаДС.Добавить(ПланыСчетов.Счета.СчетВБанке);
	
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
				|	Счета.Ссылка КАК Ссылка
				|ИЗ
				|	ПланСчетов.Счета КАК Счета
				|ГДЕ
				|	Счета.Ссылка В ИЕРАРХИИ(&СписокСчетовУчетаДС)";
	
			Запрос.УстановитьПараметр("СписокСчетовУчетаДС", СписокСчетовУчетаДС);
	
		Иначе
	
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
				|	СчетаВидыСубконто.Ссылка
				|ИЗ
				|	ПланСчетов.Счета.ВидыСубконто КАК СчетаВидыСубконто
				|ГДЕ
				|	СчетаВидыСубконто.ВидСубконто = &ВидСубконто";
	
			Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств);
	
		КонецЕсли;
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
			ПС_Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	
			Если ВестиУчет Тогда
	
				Если ПС_Объект.ВидыСубконто.Количество() = 2 Тогда
					Продолжить;
				КонецЕсли;
	
				НоваяСтрока = ПС_Объект.ВидыСубконто.Добавить();
				НоваяСтрока.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств;
	
			Иначе
	
				СтрокаДляУдаления = ПС_Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств, "ВидСубконто");
	
				ПС_Объект.ВидыСубконто.Удалить(СтрокаДляУдаления);
	
			КонецЕсли;
	
			ПС_Объект.Записать();
	
		КонецЦикла;
	
	КонецПроцедуры
#КонецОбласти
